-- 用户模拟数据
INSERT INTO users (id, user_name, password) VALUES
('100000000', 'user_0', '0'),
('100000001', 'user_1', 'hashed_pwd_1'),
('100000002', 'user_2', 'hashed_pwd_2'),
('100000003', 'user_3', 'hashed_pwd_3'),
('100000004', 'user_4', 'hashed_pwd_4');

-- 管理员
INSERT INTO station_manager (id, manager_name, password) VALUES
('200000', 'admin_0', '0'),
('200001', 'admin_1', 'admin_pwd_1'),
('200002', 'admin_2', 'admin_pwd_2'),
('200003', 'admin_3', 'admin_pwd_3'),
('200004', 'admin_4', 'admin_pwd_4');

-- 驿站
INSERT INTO stations (manager_id, station_name, address, business_hours, capacity, is_open) VALUES
('200000', '南山驿站', '深圳市南山区科技园', '08:00-20:00', 100, TRUE),
('200001', '西湖驿站', '杭州市西湖区龙井路', '06:00-17:00', 90, FLASE),
('200002', '中关村驿站', '北京市中关村南大街', '09:00-22:00', 100, TRUE),
('200003', '浦东驿站', '上海市浦东新区张江路', '08:00-20:00', 150, TRUE),
('200004', '鼓楼驿站', '南京市鼓楼区中山北路', '10:00-22:00', 200, TRUE),
('200000', '江汉驿站', '武汉市江汉区青年路', '08:00-20:00', 100, TRUE);

INSERT INTO favorites (user_id, station_id) VALUES
('100000003', 1),
('100000001', 1),
('100000004', 1),
('100000002', 2),
('100000001', 2),
('100000003', 2),
('100000001', 3),
('100000002', 3),
('100000001', 3),
('100000001', 4),
('100000003', 4),
('100000004', 4),
('100000002', 5),
('100000001', 5),
('100000004', 5);












